## Module 4: Cleaning data with pandas
## Weekly Assignment 4B
### Brandan Owens and Loan Pham

### Q.1 Download the dataset "adult_income_data.csv"

In [37]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [38]:
# (a) read in the dataset with pd.read_csv. Show the first 8 records, whatâ€™s wrong with the process of importing the dataset.
income_data = pd.read_csv("../dataFiles/adult_income_data.csv")
income_data.head(8)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,Female,0,0,40,United-States,<=50K
5,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Female,0,0,16,Jamaica,<=50K
6,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,45,United-States,>50K
7,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,Female,14084,0,50,United-States,>50K

In [39]:
# (b) read the dataset again and bear in mind that the dataset has no header (use header = None).
income_data = pd.read_csv("../dataFiles/adult_income_data.csv", header = None)
income_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [40]:
# (c) name the columns. Refer to the "adult_income_names.txt"
names=[]
with open("../dataFiles/adult_income_names.txt","r") as f:
    for line in f:
        f.readline()
        var = line.split(":")[0]
        names.append(var)
names
income_data.columns = names
income_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,wage_category
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [41]:
# (d) get the statistical summary of the dataset.
income_data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [42]:
# (e) Create a DataFrame with only age, education, and occupation

income_data = income_data[['age','education','occupation']]
income_data.head()

   age   education          occupation
0   39   Bachelors        Adm-clerical
1   50   Bachelors     Exec-managerial
2   38     HS-grad   Handlers-cleaners
3   53        11th   Handlers-cleaners
4   28   Bachelors      Prof-specialty

In [43]:
# (g) Find the number of people who are aged between 30 and 50

income_data = income_data['age'].between(30, 50)
income_data.head()

   age   education          occupation
0   39   Bachelors        Adm-clerical
1   50   Bachelors     Exec-managerial
2   38     HS-grad   Handlers-cleaners
5   37     Masters     Exec-managerial
6   49         9th       Other-service

In [44]:
# (h) Find the number of people who are aged between 30 and 50, and made positive capital gain.

adCapGain = adWithNames[['age','education','occupation','capital-gain']]
adCapGain = adCapGain[(adWithNames['age'] >= 30) & (adCapGain['age'] <= 50)  & (adCapGain['capital-gain'] > 0)]
adCapGain.head()

    age   education          occupation  capital-gain
0    39   Bachelors        Adm-clerical          2174
8    31     Masters      Prof-specialty         14084
9    42   Bachelors     Exec-managerial          5178
59   30     HS-grad   Machine-op-inspct          5013
60   30   Bachelors               Sales          2407

In [45]:
# (i)  group by "occupation", show the median age of each group.

grouped = adAgeEdOcc.groupby('occupation')['age'].median()
grouped

occupation
 ?                    37.0
 Adm-clerical         39.0
 Armed-Forces         36.5
 Craft-repair         38.0
 Exec-managerial      40.0
 Farming-fishing      39.0
 Handlers-cleaners    37.0
 Machine-op-inspct    39.0
 Other-service        38.0
 Priv-house-serv      41.0
 Prof-specialty       40.0
 Protective-serv      38.0
 Sales                39.0
 Tech-support         38.0
 Transport-moving     39.0
Name: age, dtype: float64

In [46]:
# (j)  use the following codes to create two dataframes
data_income = adWithNames
df1 = data_income[['age', 'workclass', 'occupation']].sample(5,random_state=101)
df2 = data_income[['education','occupation']].sample(5,random_state=101)
df1.head()
df2.head()
# merge df1 with df2. The key is  'occupation'
#data_income.merge(df1, df2, on="occupation")
#data_income.head()

      education          occupation
22357   HS-grad   Machine-op-inspct
26009      11th               Sales
20734   HS-grad     Exec-managerial
17695      10th   Handlers-cleaners
27908   7th-8th        Craft-repair

In [47]:
#Q.2.a Read in dataset 'Energy Indicators.xls'. Exclude the footer & header info, the first two columns and change the labels to reflect ['Country','Energy Supply','Energy Supply per Capita','% Renewable']. Be sure to remove everything but the characters in 'Country'. Rename the following countries ["Republic of Korea":"South Korea","United States of America":"United States","United Kingdom of Great Britain and Northern Ireland":"United Kingdom","China, Hong Kong Special Administrative Region":"Hong Kong","Bolivia (Plurinational State of)":"Bolivia","Switzerland17":"Switzerland"].

In [48]:
#Q.2.b Load the GDP Data from "world_bank.xlsx". Exclude the header, rename the following countries ["Korea, Rep.":"South Korea","Iran, Islamic Rep.":"Iran","Hong Kong SAR, China":"Hong Kong"]

In [49]:
#Q.2.c Load the dataset scimagojr.xlsx

In [50]:
#Q.2.d Join the three datasets, retain only the last 10 years of GDP data and only the top 15 countries by Scimagojr 'Rank'

In [51]:
#Q.2.e What is the average GDP over the last 10 years for each country?

In [52]:
#Q.2.f By how much had the GDP changed over the 10-year span for the country with the 6th largest average GDP?

In [53]:
#Q.2.g Create a new column that is the ration of Self-Citations to Total Citations. What is the maximum value for this new column, and what country has the highest ratio?